RSX-Engineering/arduino_saberprop-stm/boards.txt
# See: https://arduino.github.io/arduino-cli/latest/platform-specification/

#menu.pnum=Board part number

#menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)
#menu.virtio=Virtual serial support

menu.opt=Optimize
menu.dbg=Debug symbols and core logs
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

menu.boardVersion=Board Version
#menu.operatingSys=Operating System
menu.prop=Prop
menu.SupportedBlades=Supported blades
menu.tdeveloper=Developer Mode
menu.zdiagnoseMode=Diagnose Mode

################################################################################
# Generic U5
GenU5.name=SaberProp Lite

GenU5.build.core=arduino
GenU5.build.board=GenU5
GenU5.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -DSABERPROP_LITE -DARDUINO_ARCH_STM32U5 -DHWVER='{bv.selection}' -D{os.selection} -D{devMode.selection} -D{sp.selection} -D{pp.selection} -DHW_NUM_BLADES={sb.selection} -DHW_NUM_BUTTONS=2 -DHW_PREFIX=S -DHW_LETTER1={bv.audio} -DHW_LETTER2={bv.charger} -DHW_LETTER3={bv.sns} -DHW_LETTER4={bv.pwmch} -DHW_LETTER5={bv.booster}
GenU5.build.mcu=cortex-m33
GenU5.build.fpu=-mfpu=fpv4-sp-d16
GenU5.build.float-abi=-mfloat-abi=hard
GenU5.build.series=STM32U5xx
GenU5.build.flash_offset=0x0
GenU5.upload.maximum_size=0
GenU5.upload.maximum_data_size=0

# Generic U535RETx
#GenU5.menu.pnum.GENERIC_U535RETX=Generic U535RETx
#GenU5.menu.pnum.GENERIC_U535RETX.upload.maximum_size=524288
#GenU5.menu.pnum.GENERIC_U535RETX.upload.maximum_data_size=280576
#GenU5.menu.pnum.GENERIC_U535RETX.build.board=GENERIC_U535RETX
#GenU5.menu.pnum.GENERIC_U535RETX.build.product_line=STM32U535xx
#GenU5.menu.pnum.GENERIC_U535RETX.build.variant=STM32U5xx/U535R(B-C-E)T_U545RET

GenU5.upload.maximum_size=524288
GenU5.upload.maximum_data_size=280576
GenU5.build.board=GENERIC_U535RETX
GenU5.build.product_line=STM32U535xx
GenU5.build.variant=STM32U5xx/U535R(B-C-E)T_U545RET

# Upload menu
GenU5.menu.upload_method.swdMethod=ST-Link (SWD)
GenU5.menu.upload_method.swdMethod.upload.protocol=0
GenU5.menu.upload_method.swdMethod.upload.options=
GenU5.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenU5.menu.upload_method.serialMethod=DevPort (Serial)
GenU5.menu.upload_method.serialMethod.upload.protocol=1
GenU5.menu.upload_method.serialMethod.upload.options={serial.port.file}
GenU5.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenU5.menu.upload_method.dfuMethod=USB (DFU)
GenU5.menu.upload_method.dfuMethod.upload.protocol=2
GenU5.menu.upload_method.dfuMethod.upload.options=
GenU5.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

#GenU5.menu.xserial.generic=Enabled (generic 'Serial')
#GenU5.menu.xserial.none=Enabled (no generic 'Serial')
#GenU5.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
#GenU5.menu.xserial.disabled=Disabled (no Serial support)
#GenU5.menu.xserial.disabled.build.xSerial=

#GenU5.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE

#GenU5.menu.usb.none=None
#GenU5.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
#GenU5.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
#GenU5.menu.usb.CDC=CDC (no generic 'Serial')
#GenU5.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
#GenU5.menu.usb.HID=HID (keyboard and mouse)
#GenU5.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
#GenU5.menu.xusb.FS=Low/Full Speed
#GenU5.menu.xusb.HS=High Speed
#GenU5.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
#GenU5.menu.xusb.HSFS=High Speed in Full Speed mode
#GenU5.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

#GenU5.menu.opt.osstd=Smallest (-Os default)
#GenU5.menu.opt.osstd.build.flags.optimize=-Os
#GenU5.menu.opt.oslto=Smallest (-Os) with LTO
#GenU5.menu.opt.oslto.build.flags.optimize=-Os -flto
#GenU5.menu.opt.o1std=Fast (-O1)
#GenU5.menu.opt.o1std.build.flags.optimize=-O1
#GenU5.menu.opt.o1lto=Fast (-O1) with LTO
#GenU5.menu.opt.o1lto.build.flags.optimize=-O1 -flto
#GenU5.menu.opt.o2std=Faster (-O2)
#GenU5.menu.opt.o2std.build.flags.optimize=-O2
#GenU5.menu.opt.o2lto=Faster (-O2) with LTO
#GenU5.menu.opt.o2lto.build.flags.optimize=-O2 -flto
#GenU5.menu.opt.o3std=Fastest (-O3)
#GenU5.menu.opt.o3std.build.flags.optimize=-O3
#GenU5.menu.opt.o3lto=Fastest (-O3) with LTO
#GenU5.menu.opt.o3lto.build.flags.optimize=-O3 -flto
#GenU5.menu.opt.ogstd=Debug (-Og)
#GenU5.menu.opt.ogstd.build.flags.optimize=-Og
#GenU5.menu.opt.o0std=No Optimization (-O0)
#GenU5.menu.opt.o0std.build.flags.optimize=-O0

GenU5.build.flags.optimize=-Os

#GenU5.menu.rtlib.nano=Newlib Nano (default)
#GenU5.menu.rtlib.nanofp=Newlib Nano + Float Printf
#GenU5.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
#GenU5.menu.rtlib.nanofs=Newlib Nano + Float Scanf
#GenU5.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
#GenU5.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
#GenU5.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
#GenU5.menu.rtlib.full=Newlib Standard
#GenU5.menu.rtlib.full.build.flags.ldspecs=

## ==== BOARD VERSION ========= ##
GenU5.menu.boardVersion.HWVER1=SL31L
GenU5.menu.boardVersion.HWVER1.bv.selection=S31L
GenU5.menu.boardVersion.HWVER1.bv.audio=3
GenU5.menu.boardVersion.HWVER1.bv.charger=1
GenU5.menu.boardVersion.HWVER1.bv.sns=L
GenU5.menu.boardVersion.HWVER1.bv.pwmch=4
GenU5.menu.boardVersion.HWVER1.bv.booster=1

GenU5.menu.boardVersion.HWVER2=SL30L
GenU5.menu.boardVersion.HWVER2.bv.selection=S30L
GenU5.menu.boardVersion.HWVER2.bv.audio=3
GenU5.menu.boardVersion.HWVER2.bv.charger=0
GenU5.menu.boardVersion.HWVER2.bv.sns=L
GenU5.menu.boardVersion.HWVER2.bv.pwmch=4
GenU5.menu.boardVersion.HWVER2.bv.booster=1

## === APPLICATION OPERATING SYSTEM ===== ##
#GenU5.menu.operatingSys.pfosx=ProffieOSX
#GenU5.menu.operatingSys.pfosx.os.selection=OSx
#GenU5.menu.operatingSys.pfos=ProffieOS
#GenU5.menu.operatingSys.pfos.os.selection=OSx_None
GenU5.os.selection=OSx

## === PROP SELECTION === ##
GenU5.menu.prop.prop1=SaberProp
GenU5.menu.prop.prop1.pp.selection=PF_PROP_SABER
GenU5.menu.prop.prop2=UltraSaber
GenU5.menu.prop.prop2.pp.selection=PF_PROP_ULTRASABERS
GenU5.menu.prop.prop3=Saber
GenU5.menu.prop.prop3.pp.selection=PF_PROP_SABER


## === SUPORTED BLADES === ##
GenU5.menu.SupportedBlades.sbdefTwo=2 (default)
GenU5.menu.SupportedBlades.sbdefTwo.sb.selection=2
GenU5.menu.SupportedBlades.sbOne=1
GenU5.menu.SupportedBlades.sbOne.sb.selection=1
GenU5.menu.SupportedBlades.sbTwo=2
GenU5.menu.SupportedBlades.sbTwo.sb.selection=2
GenU5.menu.SupportedBlades.sbThree=3
GenU5.menu.SupportedBlades.sbThree.sb.selection=3
GenU5.menu.SupportedBlades.sbFour=4
GenU5.menu.SupportedBlades.sbFour.sb.selection=4
GenU5.menu.SupportedBlades.sbFive=5
GenU5.menu.SupportedBlades.sbFive.sb.selection=5
GenU5.menu.SupportedBlades.sbSix=6
GenU5.menu.SupportedBlades.sbSix.sb.selection=6

## === DEVELOPER MODE === ##
GenU5.menu.tdeveloper.devOff=Off
GenU5.menu.tdeveloper.devOff.devMode.selection=PF_DEVELOPER_MODE_OFF
GenU5.menu.tdeveloper.devOn=On
GenU5.menu.tdeveloper.devOn.devMode.selection=PF_DEVELOPER_MODE_ON

## === DIAGNOSE MODE === ##
GenU5.menu.zdiagnoseMode.statusOn=On
GenU5.menu.zdiagnoseMode.statusOn.sp.selection=PF_STATUS_REPORT_ON
GenU5.menu.zdiagnoseMode.statusOff=Off
GenU5.menu.zdiagnoseMode.statusOff.sp.selection=PF_STATUS_REPORT_OFF